
var seaBottomTimeInterval; // переменная для хранения интервала анимации для нижней части моря

const seaBottomMotionSize = 3; // размер перемещения нижнего блока моря 
const seaBottomMotionDelay = 30; // задержка скорость движения нижнего блока моря 


var islandTimeInterval; // переменная для хранения интервала анимации острова

const islandMotionSize = 3; // размер перемещения нижнего блока моря 
const islandMotionDelay = 50; // задержка скорость движения нижнего блока моря 


var kitTimeInterval; // переменная для хранения интервала анимации острова

const kitMotionSize = 3; // размер перемещения нижнего блока моря 
const kitMotionDelay = 50; // задержка скорость движения нижнего блока моря 


var cloud1TimeInterval; // переменная для хранения интервала анимации облако №1
var cloud2TimeInterval; // переменная для хранения интервала анимации облако №2

const cloudMotionSize = 3; // размер перемещения нижнего блока моря 
const cloudMotionDelay = 20; // задержка скорость движения нижнего блока моря 
// второе облако - то что дальше движется в два раза медленнее чем первое




